---
kind: enumMember
id: F:Autodesk.Revit.DB.DatumExtentType.ViewSpecific
enum: Autodesk.Revit.DB.DatumExtentType
source: html/7a968bc3-1860-6a8b-6f3a-2b23b80a56a5.htm
---
# Autodesk.Revit.DB.DatumExtentType.ViewSpecific

The extent displayed is specific to the view and does not represent the actual 3D extent of the datum plane.